Revit 2027 API
CameraInfo.RightOffset Property
 Distance that the target plane is offset towards the right where right is normal to both Up direction and View direction. This offset shifts both left and right planes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double RightOffset { get; }
Public ReadOnly Property RightOffset As Double
	Get
public:
property double RightOffset {
	double get ();
}
member RightOffset : float with get
Property Value
Double
See Also
Reference
CameraInfo Class
Autodesk.Revit.DB Namespace